In [2]:
import pandas as pd

In [3]:
order_df = pd.read_csv("orders.csv")
orderlines_df = pd.read_csv("orderlines.csv")
brands_df = pd.read_csv("brands.csv")
products_df = pd.read_csv("products.csv")

In [ ]:
# url = "https://drive.google.com/file/d/1Vu0q91qZw6lqhIqbjoXYvYAQTmVHh6uZ/view?usp=drive_link" # order.csv
# path = "https://drive.google.com/uc?export=download&id="+url.split("/")[-2]
# order_df = pd.read_csv(path)

# url = "https://drive.google.com/file/d/1afxwDXfl-7cQ_qLwyDitfcCx3u7WMvkU/view?usp=drive_link" # products.csv
# path = "https://drive.google.com/uc?export=download&id="+url.split("/")[-2]
# products_df = pd.read_csv(path)

# url = "https://drive.google.com/file/d/1FYhN_2AzTBFuWcfHaRuKcuCE6CWXsWtG/view?usp=drive_link" # orderlines.csv
# path = "https://drive.google.com/uc?export=download&id="+url.split("/")[-2]
# orderlines_df = pd.read_csv(path)

# url = "https://drive.google.com/file/d/1m1ThDDIYRTTii-rqM5SEQjJ8McidJskD/view?usp=drive_link" # brands.csv
# path = "https://drive.google.com/uc?export=download&id="+url.split("/")[-2]
# brands_df = pd.read_csv(path)

In [57]:
pd.options.display.max_rows = 10

# First Task: Custom exploration

In [36]:
order_df.count()
# Answer: There are 226_909 orders in total.

order_id        226909
created_date    226909
total_paid      226904
state           226909
dtype: int64

In [37]:
products_df.count()
# Answer: There are 19_326 products in total.

sku            19326
name           19326
desc           19319
price          19280
promo_price    19326
in_stock       19326
type           19276
dtype: int64

In [42]:
order_df["created_date"].sort_values().unique()
# Answer: The data has orders from the beginning of 2017 to march of 2018. So 15 months in total.

array(['2017-01-01 00:07:19', '2017-01-01 00:19:45',
       '2017-01-01 00:20:57', ..., '2018-03-14 13:57:41',
       '2018-03-14 13:57:54', '2018-03-14 13:58:36'],
      shape=(224828,), dtype=object)

In [43]:
order_df.groupby("state").count()
# Answer: There are 46_605 orders with the status Completed in the data.

                 order_id  created_date  total_paid
state
Cancelled            7233          7233        7233
Completed           46605         46605       46605
Pending             14379         14379       14374
Place Order         40883         40883       40883
Shopping Basket    117809        117809      117809

In [ ]:
# How should revenue be computed?
# Answer: The money that came in from the orders with the status of Completed and Place Order are useful in computing revenue.

# Orders

## Information

In [4]:
order_df

        order_id         created_date  total_paid            state
0         241319  2017-01-02 13:35:40       44.99        Cancelled
1         241423  2017-11-06 13:10:02      136.15        Completed
2         242832  2017-12-31 17:40:03       15.76        Completed
3         243330  2017-02-16 10:59:38       84.98        Completed
4         243784  2017-11-24 13:35:19      157.86        Cancelled
...          ...                  ...         ...              ...
226904    527397  2018-03-14 13:56:38       42.99      Place Order
226905    527398  2018-03-14 13:57:25       42.99  Shopping Basket
226906    527399  2018-03-14 13:57:34      141.58  Shopping Basket
226907    527400  2018-03-14 13:57:41       19.98  Shopping Basket
226908    527401  2018-03-14 13:58:36       18.98      Place Order

[226909 rows x 4 columns]

In [5]:
order_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 226909 entries, 0 to 226908
Data columns (total 4 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   order_id      226909 non-null  int64
 1   created_date  226909 non-null  object
 2   total_paid    226904 non-null  float64
 3   state         226909 non-null  object
dtypes: float64(1), int64(1), object(2)
memory usage: 6.9+ MB

In [6]:
order_df.shape

(226909, 4)

In [7]:
order_df.describe()

            order_id     total_paid
count  226909.000000  226904.000000
mean   413296.482480     569.225818
std     65919.250331    1761.778002
min    241319.000000       0.000000
25%    356263.000000      34.190000
50%    413040.000000     112.990000
75%    470553.000000     525.980000
max    527401.000000  214747.530000

In [8]:
order_df.nunique()

order_id        226909
created_date    224828
total_paid       31236
state                5
dtype: int64

In [11]:
order_df.head()

   order_id         created_date  total_paid      state
0    241319  2017-01-02 13:35:40       44.99  Cancelled
1    241423  2017-11-06 13:10:02      136.15  Completed
2    242832  2017-12-31 17:40:03       15.76  Completed
3    243330  2017-02-16 10:59:38       84.98  Completed
4    243784  2017-11-24 13:35:19      157.86  Cancelled

In [12]:
order_df.tail()

        order_id         created_date  total_paid            state
226904    527397  2018-03-14 13:56:38       42.99      Place Order
226905    527398  2018-03-14 13:57:25       42.99  Shopping Basket
226906    527399  2018-03-14 13:57:34      141.58  Shopping Basket
226907    527400  2018-03-14 13:57:41       19.98  Shopping Basket
226908    527401  2018-03-14 13:58:36       18.98      Place Order

In [13]:
order_df.isna().sum()

order_id        0
created_date    0
total_paid      5
state           0
dtype: int64

In [14]:
order_df.duplicated().sum()

np.int64(0)

## Deeper Search

In [9]:
order_df["state"].unique()

array(['Cancelled', 'Completed', 'Pending', 'Shopping Basket',
       'Place Order'], dtype=object)

In [10]:
order_df.groupby("state").count()

                 order_id  created_date  total_paid
state
Cancelled            7233          7233        7233
Completed           46605         46605       46605
Pending             14379         14379       14374
Place Order         40883         40883       40883
Shopping Basket    117809        117809      117809

In [15]:
order_df.nlargest(5,"total_paid")

        order_id         created_date  total_paid            state
96028     395611  2017-09-01 20:56:34   214747.53  Shopping Basket
2478      301934  2017-01-03 19:27:13   214746.63  Shopping Basket
183927    484334  2018-01-07 15:58:26   214714.31  Shopping Basket
61659     361200  2017-06-01 11:55:02   214642.47  Shopping Basket
40557     340045  2017-03-28 13:27:52   214517.58  Shopping Basket

In [16]:
order_df.nsmallest(5,"total_paid")

     order_id         created_date  total_paid            state
150    296010  2017-01-09 23:47:00         0.0        Completed
264    299605  2017-01-01 10:33:46         0.0  Shopping Basket
308    299651  2017-01-01 12:23:58         0.0  Shopping Basket
377    299731  2017-01-01 14:52:18         0.0  Shopping Basket
380    299734  2017-01-01 14:55:20         0.0  Shopping Basket

In [ ]:
#order_df["created_date"].first("3D")
# needs "created date" column to be converted to dateframe

# Products

## Information

In [17]:
products_df

,sku,name,desc,price,promo_price,in_stock,type
0,RAI0007,Silver Rain Design mStand Support,Aluminum support compatible with all MacBook,59.99,499.899,1,8696
1,APP0023,Apple Mac Keyboard Keypad Spanish,USB ultrathin keyboard Apple Mac Spanish.,59,589.996,0,13855401
2,APP0025,Mighty Mouse Apple Mouse for Mac,mouse Apple USB cable.,59,569.898,0,1387
3,APP0072,Apple Dock to USB Cable iPhone and iPod white,IPhone dock and USB Cable Apple iPod.,25,229.997,0,1230
4,KIN0007,Mac Memory Kingston 2GB 667MHz DDR2 SO-DIMM,2GB RAM Mac mini and iMac (2006/07) MacBook Pr...,34.99,31.99,1,1364
...,...,...,...,...,...,...,...
19321,BEL0376,Belkin Travel Support Apple Watch Black,compact and portable stand vertically or horiz...,29.99,269.903,1,12282
19322,THU0060,"Enroute Thule 14L Backpack MacBook 13 ""Black",Backpack with capacity of 14 liter compartment...,69.95,649.903,1,1392
19323,THU0061,"Enroute Thule 14L Backpack MacBook 13 ""Blue",Backpack with capacity of 14 liter compartment...,69.95,649.903,1,1392
19324,THU0062,"Enroute Thule 14L Backpack MacBook 13 ""Red",Backpack with capacity of 14 liter compartment...,69.95,649.903,0,1392
19325,THU0063,"Enroute Thule 14L Backpack MacBook 13 ""Green",Backpack with capacity of 14 liter compartment...,69.95,649.903,1,1392

In [18]:
products_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19326 entries, 0 to 19325
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   sku          19326 non-null  object
 1   name         19326 non-null  object
 2   desc         19319 non-null  object
 3   price        19280 non-null  object
 4   promo_price  19326 non-null  object
 5   in_stock     19326 non-null  int64
 6   type         19276 non-null  object
dtypes: int64(1), object(6)
memory usage: 1.0+ MB

In [19]:
products_df.shape

(19326, 7)

In [20]:
products_df.describe()

           in_stock
count  19326.000000
mean       0.109593
std        0.312390
min        0.000000
25%        0.000000
50%        0.000000
75%        0.000000
max        1.000000

In [21]:
products_df.nunique()

sku            10579
name           10373
desc            7098
price           2690
promo_price     4614
in_stock           2
type             126
dtype: int64

In [50]:
products_df.head()

,sku,name,desc,price,promo_price,in_stock,type
0,RAI0007,Silver Rain Design mStand Support,Aluminum support compatible with all MacBook,59.99,499.899,1,8696
1,APP0023,Apple Mac Keyboard Keypad Spanish,USB ultrathin keyboard Apple Mac Spanish.,59,589.996,0,13855401
2,APP0025,Mighty Mouse Apple Mouse for Mac,mouse Apple USB cable.,59,569.898,0,1387
3,APP0072,Apple Dock to USB Cable iPhone and iPod white,IPhone dock and USB Cable Apple iPod.,25,229.997,0,1230
4,KIN0007,Mac Memory Kingston 2GB 667MHz DDR2 SO-DIMM,2GB RAM Mac mini and iMac (2006/07) MacBook Pr...,34.99,31.99,1,1364

In [51]:
products_df.tail()

,sku,name,desc,price,promo_price,in_stock,type
19321,BEL0376,Belkin Travel Support Apple Watch Black,compact and portable stand vertically or horiz...,29.99,269.903,1,12282
19322,THU0060,"Enroute Thule 14L Backpack MacBook 13 ""Black",Backpack with capacity of 14 liter compartment...,69.95,649.903,1,1392
19323,THU0061,"Enroute Thule 14L Backpack MacBook 13 ""Blue",Backpack with capacity of 14 liter compartment...,69.95,649.903,1,1392
19324,THU0062,"Enroute Thule 14L Backpack MacBook 13 ""Red",Backpack with capacity of 14 liter compartment...,69.95,649.903,0,1392
19325,THU0063,"Enroute Thule 14L Backpack MacBook 13 ""Green",Backpack with capacity of 14 liter compartment...,69.95,649.903,1,1392

In [52]:
products_df.isna().sum()

sku             0
name            0
desc            7
price          46
promo_price     0
in_stock        0
type           50
dtype: int64

In [35]:
products_df.duplicated().sum()

np.int64(8746)

## Deeper Search

In [22]:
products_df["sku"].unique()

array(['RAI0007', 'APP0023', 'APP0025', ..., 'THU0061', 'THU0062',
       'THU0063'], shape=(10579,), dtype=object)

In [23]:
products_df["desc"].unique()

array(['Aluminum support compatible with all MacBook',
       'USB ultrathin keyboard Apple Mac Spanish.',
       'mouse Apple USB cable.', ...,
       'Backpack thin nylon mesh internal compartment and anti-RFID MacBook Pro 13',
       'compact and portable stand vertically or horizontally for Apple Watch',
       'Backpack with capacity of 14 liter compartments MacBook up to 13 inches up to 10 inches Cases'],
      shape=(7099,), dtype=object)

In [24]:
products_df["type"].unique()

array(['8696', '13855401', '1387', '1230', '1364', '1325', '5384', '1334',
       '13005399', '13835403', '12995397', '11865403', '13955395', '1216',
       '12355400', '5,49E+11', '1276', '11905404', '12635403', '12755395',
       '1296', '12285400', '1229', '11935397', '12655397', '1404',
       '101781405', '4259', '14035403', '12085400', '1282', '12175397',
       '1424', '9094', '1405', '57445397', nan, '14305406', '10142',
       '12645406', '10230', '12215397', '11821715', '13555403',
       '1,44E+11', '14365395', '5405', '5395', '5398', '21485407',
       '20642062', '1,46E+11', '1280', '12575403', '1433', '1515', '5720',
       '1298', '13615399', '12585395', '1392', '1231', '15435404', '1375',
       '42945397', '12141714', '42931714', '54025401', '21535407', '1416',
       '2,17E+11', '24215399', '11434', '2425', '2434', '2449',
       '13621714', '24861714', '24821716', '5,74E+15', '54864259',
       '51861714', '1714', '51601716', '51871714', '5403', '54085407',
       '24885185', '24895185', '5407', '5406', '5404', '5,44E+11',
       '85641716', '24811716', '85651716', '2158', '1,02E+12', '51882158',
       '5,43E+15', '5,72E+15', '5401', '12051714', '9,29E+11', '5399',
       '1716', '21622158', '5,39E+11', '12031714', '21571716', '2,16E+11',
       '106431714', '21632158', '21561716', '79201715', '51902158',
       '5185', '113291716', '113281716', '113271716', '113464259',
       '5,45E+15', '113851714', '11859', '118692158', '51912158', '12282'],
      dtype=object)

# Orderlines

## Information

In [28]:
orderlines_df

,id,id_order,product_id,product_quantity,sku,unit_price,date
0,1119109,299539,0,1,OTT0133,18.99,2017-01-01 00:07:19
1,1119110,299540,0,1,LGE0043,399.00,2017-01-01 00:19:45
2,1119111,299541,0,1,PAR0071,474.05,2017-01-01 00:20:57
3,1119112,299542,0,1,WDT0315,68.39,2017-01-01 00:51:40
4,1119113,299543,0,1,JBL0104,23.74,2017-01-01 01:06:38
...,...,...,...,...,...,...,...
293978,1650199,527398,0,1,JBL0122,42.99,2018-03-14 13:57:25
293979,1650200,527399,0,1,PAC0653,141.58,2018-03-14 13:57:34
293980,1650201,527400,0,2,APP0698,9.99,2018-03-14 13:57:41
293981,1650202,527388,0,1,BEZ0204,19.99,2018-03-14 13:58:01
293982,1650203,527401,0,1,APP0927,13.99,2018-03-14 13:58:36

In [25]:
orderlines_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 293983 entries, 0 to 293982
Data columns (total 7 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   id                293983 non-null  int64
 1   id_order          293983 non-null  int64
 2   product_id        293983 non-null  int64
 3   product_quantity  293983 non-null  int64
 4   sku               293983 non-null  object
 5   unit_price        293983 non-null  object
 6   date              293983 non-null  object
dtypes: int64(4), object(3)
memory usage: 15.7+ MB

In [44]:
orderlines_df.shape

(293983, 7)

In [45]:
orderlines_df.describe()

                 id       id_order  product_id  product_quantity
count  2.939830e+05  293983.000000    293983.0     293983.000000
mean   1.397918e+06  419999.116544         0.0          1.121126
std    1.530096e+05   66344.486479         0.0          3.396569
min    1.119109e+06  241319.000000         0.0          1.000000
25%    1.262542e+06  362258.500000         0.0          1.000000
50%    1.406940e+06  425956.000000         0.0          1.000000
75%    1.531322e+06  478657.000000         0.0          1.000000
max    1.650203e+06  527401.000000         0.0        999.000000

In [46]:
orderlines_df.nunique()

id                  293983
id_order            204855
product_id               1
product_quantity        67
sku                   7951
unit_price           11329
date                251631
dtype: int64

In [53]:
orderlines_df.head()

,id,id_order,product_id,product_quantity,sku,unit_price,date
0,1119109,299539,0,1,OTT0133,18.99,2017-01-01 00:07:19
1,1119110,299540,0,1,LGE0043,399.00,2017-01-01 00:19:45
2,1119111,299541,0,1,PAR0071,474.05,2017-01-01 00:20:57
3,1119112,299542,0,1,WDT0315,68.39,2017-01-01 00:51:40
4,1119113,299543,0,1,JBL0104,23.74,2017-01-01 01:06:38

In [54]:
orderlines_df.tail()

,id,id_order,product_id,product_quantity,sku,unit_price,date
293978,1650199,527398,0,1,JBL0122,42.99,2018-03-14 13:57:25
293979,1650200,527399,0,1,PAC0653,141.58,2018-03-14 13:57:34
293980,1650201,527400,0,2,APP0698,9.99,2018-03-14 13:57:41
293981,1650202,527388,0,1,BEZ0204,19.99,2018-03-14 13:58:01
293982,1650203,527401,0,1,APP0927,13.99,2018-03-14 13:58:36

In [55]:
orderlines_df.isna().sum()

id                  0
id_order            0
product_id          0
product_quantity    0
sku                 0
unit_price          0
date                0
dtype: int64

In [30]:
orderlines_df.duplicated().sum()

np.int64(0)

## Deeper Search

In [56]:
orderlines_df["sku"].info()

<class 'pandas.core.series.Series'>
RangeIndex: 293983 entries, 0 to 293982
Series name: sku
Non-Null Count   Dtype
--------------   -----
293983 non-null  object
dtypes: object(1)
memory usage: 2.2+ MB

# Brands

## Information

In [27]:
brands_df

    short       long
0     8MO  8Mobility
1     ACM       Acme
2     ADN     Adonit
3     AII      Aiino
4     AKI     Akitio
..    ...        ...
182   XOO     Xoopar
183   XRI     X-Rite
184   XTO      Xtorm
185   ZAG   ZaggKeys
186   ZEP       Zepp

[187 rows x 2 columns]

In [26]:
brands_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 187 entries, 0 to 186
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   short   187 non-null    object
 1   long    187 non-null    object
dtypes: object(2)
memory usage: 3.1+ KB

In [58]:
brands_df.shape

(187, 2)

In [59]:
brands_df.describe()

       short   long
count    187    187
unique   187    181
top      8MO  Apple
freq       1      2

In [60]:
brands_df.nunique()

short    187
long     181
dtype: int64

In [61]:
brands_df.head()

  short       long
0   8MO  8Mobility
1   ACM       Acme
2   ADN     Adonit
3   AII      Aiino
4   AKI     Akitio

In [62]:
brands_df.tail()

    short      long
182   XOO    Xoopar
183   XRI    X-Rite
184   XTO     Xtorm
185   ZAG  ZaggKeys
186   ZEP      Zepp

In [63]:
brands_df.isna().sum()

short    0
long     0
dtype: int64

In [64]:
brands_df.duplicated().sum()

np.int64(0)

## Deeper Search